Autodesk.Revit.DB.Electrical.TemperatureRatingType.RemoveCorrectionFactor(Autodesk.Revit.DB.Electrical.CorrectionFactor)
Remove an existing correction factor from this temperature rating type in Revit MEP project.
correctionFactor: The correction factor to be removed.
Returns: New constructed correction factor.

Autodesk.Revit.DB.Electrical.TemperatureRatingType.AddCorrectionFactor(System.Int64,System.Double)
Add a new electrical correction factor type to this temperature rating type.
temperature: Temperature of correction factor to be added.
factor: Factor of correction factor to be added.
Returns: New constructed correction factor.

Autodesk.Revit.DB.Electrical.TemperatureRatingType.RemoveWireSize(Autodesk.Revit.DB.Electrical.WireSize)
Remove an existing wire size type from this temperature rating type.
wireSize: The wire size type to be removed.

Autodesk.Revit.DB.Electrical.TemperatureRatingType.AddWireSize(System.String,System.Int64,System.Double)
Add a new kind of wire size type into this temperature rating type.
size: Size of wire size.
ampacity: Ampacity of wire size to be added.
diameter: Diameter of wire size to be added.
Returns: Constructed wire size type.

Autodesk.Revit.DB.Electrical.TemperatureRatingType.RemoveInsulationType(Autodesk.Revit.DB.Electrical.InsulationType)
Remove an existing insulation type from this temperature rating type.
insulationType: Insulation type to be removed.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The last one insulation type of project and any one which is in use by a wire type can't be removed.

Autodesk.Revit.DB.Electrical.TemperatureRatingType.AddInsulationType(System.String)
Add a new kind of insulation type into this temperature rating type.
name: Name of insulation type symbol to be constructed and added.
Returns: Constructed insulation type instance.

Autodesk.Revit.DB.Electrical.TemperatureRatingType.IsInUse
Indicate whether the temperature rating type is in use.

Autodesk.Revit.DB.Electrical.TemperatureRatingType.CorrectionFactors
Get all correction factors defined in this temperature rating type and its corresponding material type.

Autodesk.Revit.DB.Electrical.TemperatureRatingType.WireSizes
Get all electrical wire sizes defined in this temperature rating type and its corresponding material type.

Autodesk.Revit.DB.Electrical.TemperatureRatingType.InsulationTypes
Get all insulation types defined in this temperature rating type and its corresponding material type.

Autodesk.Revit.DB.Electrical.TemperatureRatingType.MaterialType
Get the material type information which this temperature rating type belongs to.

Autodesk.Revit.DB.Electrical.TemperatureRatingType.Name
Get name of temperature rating type.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Set name can't be supported.

Autodesk.Revit.DB.Electrical.TemperatureRatingType
Represents temperature rating type definition information.
Remarks: Temperature rating type is defined based on corresponding wire material type.
It includes type information such as wire size, insulation type, correction factor, etc.
Only the temperature rating types which are retrieved from WireMaterialType can work well, so don't retrieve it from Revit document directly.